app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "6"]]
---
  def show
    id=params[:id]
    @movie=Movie.find(id)